{"pageProps":{"fileName":"Markov Chain Text Generator","file":"---\ndescription: Text generator written in React.js that uses Markov chains to generate text based on a given input.\nimageURL: markov-chain-text.jpeg\ndate: Aug 6, 2022\nendDate: Aug 7, 2022\ndemo: https://nomomon.github.io/markov-chain-text/\nsource: https://github.com/nomomon/markov-chain-text\ntags: [react, node.js, nlp, markov-chain, project]\npublish: true\n---\n\n![[markov-chain-text.jpeg]]\n\nRecently, I was reading in the Y.Practicum blog and found a [group of posts](https://thecode.media/markov-chain/) there about Markov chains. The articles were written in a easy to understand and engaging way, and I thought it would be interesting to see for myself how the algorithm works.\n\nFirst of all, the definition:\n\n> Markov chains are a sequence of events or actions, where each new event depends only on the previous one and does not take into account all other events. Such an algorithm does not remember what happened before, but only looks at the previous state.\n\nIt will be easier to understand if you look at the following example:\n\n```javascript\nconst dataset = [\"I am a human\", \"I am a programmer\", \"I am not a dog\"];\n```\n\nThis dataset results in the following tree diagram:\n\n![[diagram.png]]\n\nIn context of text generation, each word is an event. The next word is selected randomly from the words that stood after the last word. The probability of each word transition is determined by the frequency of the pair. After a random word is selected, the same thing is repeated with the sentence until the final word appears.\n\nIn the example from the image, after the word “a” in the source text there could be the words “programmer”, “human”, and “dog”. So, the new sentences that can be generated from the dataset are:\n\n> I am not a programmer\n>\n> I am not a human\n>\n> I am a dog\n\nIt certainly doesn't compare to GPT-3 or Copilot, but the results are sure ridiculous.\n\n## Results\n\nExample in Russian\n\n![demo](https://github.com/nomomon/markov-chain-text/raw/master/screenshot.png)\n"},"__N_SSG":true}